# Pandas

### Series

In [17]:
import pandas as pd
import numpy as np

In [18]:
obj = pd.Series([2, 3, 4, 5], index = ['a', 'b', 'c', 'd'])
obj

a    2
b    3
c    4
d    5
dtype: int64

In [19]:
print(obj.values)
print(obj.index)

[2 3 4 5]
Index(['a', 'b', 'c', 'd'], dtype='object')

In [20]:
obj1 = pd.Series([2, 3, 4, 5], index = ['a', 'b', 'c', 'd'], name = "practcing series")
obj1

a    2
b    3
c    4
d    5
Name: practcing series, dtype: int64

In [21]:
cntn_sw_sale = pd.Series([4, 3, 6, 6, 5, 4, 6,],
                 index=['d1','d2','d3','d4','d5','d6','d7'])
cntn_sw_sale

d1    4
d2    3
d3    6
d4    6
d5    5
d6    4
d7    6
dtype: int64

In [22]:
np.sum(cntn_sndw_sale.values) # sum of all values

NameError: name 'cntn_sndw_sale' is not defined

In [ ]:
print(cntn_sndw_sale[[3,5]])
print(cntn_sndw_sale[["d4", "d7", 'd5', 'd6']])

In [ ]:
print(cntn_sndw_sale[cntn_sndw_sale>4])

In [ ]:
print(cntn_sndw_sale*2)

In [ ]:
cntn_sndw_sale

In [ ]:
cntn_sndw_sale /4

In [ ]:
cntn_sndw_sale[3:6] + 5  #ops on slices

In [ ]:
print(cntn_sndw_sale['d4' in cntn_sndw_sale] / 3)

In [ ]:
sl = np.array([4,45,6 , 7,54])
pr = np.array(['apl', 'org', 'bnb', 'gva', 'grp'])

srs = pd.Series(sl, index=pr)
srs

In [ ]:
sdata = {"sindh" : 3222334324, "pjb" : 322356457, "kpk" : 87348734, "blstn" : 342329823}
tax_collection = pd.Series(sdata)
print(tax_collection)

In [ ]:
tax_collection.values
tax_collection.index

In [ ]:
tax_collection = pd.Series(sdata, index = ["pjb", "sindh", "kpk", "blstn", "GB"])
print(tax_collection)
print(pd.isnull(tax_collection))

# DataFrame

In [24]:
apple =  pd.Series([2, 4, 5, 6])
orange = pd.Series([5, 4, 9, 7])

data = {"apple":apple, "orange":orange}
df1 = pd.DataFrame(data)
df1

   apple  orange
0      2       5
1      4       4
2      5       9
3      6       7

In [25]:
print(apple)
print(orange)

0    2
1    4
2    5
3    6
dtype: int64
0    5
1    4
2    9
3    7
dtype: int64

In [26]:
state = ["Ohio","Ohio","Ohio","Navada","Navada","Navada"]
year = [2000,2001, 2002, 2003, 2004, 2005]
pop = [1.7, 1.6, 1.3, 1.4, 1.9, 1.3]
data = {"state":state, "year":year, "population":pop}
df2 = pd.DataFrame(data, index = ['1st', '2nd', '3rd','4th', '5th', '6th'])
df2

      state  year  population
1st    Ohio  2000         1.7
2nd    Ohio  2001         1.6
3rd    Ohio  2002         1.3
4th  Navada  2003         1.4
5th  Navada  2004         1.9
6th  Navada  2005         1.3

In [27]:
df2.head()

      state  year  population
1st    Ohio  2000         1.7
2nd    Ohio  2001         1.6
3rd    Ohio  2002         1.3
4th  Navada  2003         1.4
5th  Navada  2004         1.9

In [28]:
df3 = pd.DataFrame(data, columns=["state", "year", "population", "debt"])

In [29]:
df3

    state  year  population debt
0    Ohio  2000         1.7  NaN
1    Ohio  2001         1.6  NaN
2    Ohio  2002         1.3  NaN
3  Navada  2003         1.4  NaN
4  Navada  2004         1.9  NaN
5  Navada  2005         1.3  NaN

In [30]:
print(df3.columns)

print(df3.index)

Index(['state', 'year', 'population', 'debt'], dtype='object')
RangeIndex(start=0, stop=6, step=1)

In [31]:
# data retrieval by dictionary like notation
# data
# data['state']
# data["population"]
print(data["year"])

# data retrieval by dataframe column
print(df2["year"])

# Attribute like data retrieval
print(df2.state)
# data retrieval by location method
print(df2.loc['1st'])

[2000, 2001, 2002, 2003, 2004, 2005]
1st    2000
2nd    2001
3rd    2002
4th    2003
5th    2004
6th    2005
Name: year, dtype: int64
1st      Ohio
2nd      Ohio
3rd      Ohio
4th    Navada
5th    Navada
6th    Navada
Name: state, dtype: object
state         Ohio
year          2000
population     1.7
Name: 1st, dtype: object

In [37]:
df3["debt"]= 6.5
df3

    state  year  population  debt
0    Ohio  2000         1.7   6.5
1    Ohio  2001         1.6   6.5
2    Ohio  2002         1.3   6.5
3  Navada  2003         1.4   6.5
4  Navada  2004         1.9   6.5
5  Navada  2005         1.3   6.5

### function application and mapping

In [39]:
df4 = df4 = pd.DataFrame(np.random.randn(4, 3),
                         columns=list('abc'), index=['Utha', 'Ohio', 'Taxas', 'Oregon'])
df4

               a         b         c
Utha   -0.060683  1.810401  0.175776
Ohio   -0.658611  0.844267  0.853540
Taxas   1.275747 -0.746003 -1.066646
Oregon  0.033465 -1.440798 -0.703002

In [43]:
np.abs(df4)

               a         b         c
Utha    0.060683  1.810401  0.175776
Ohio    0.658611  0.844267  0.853540
Taxas   1.275747  0.746003  1.066646
Oregon  0.033465  1.440798  0.703002

In [42]:
print(df4["a"].min())
print(df4["a"].max())

-0.658611076281295
1.2757468513714814

In [44]:
print(df4.min())
print(df4.max())

a   -0.658611
b   -1.440798
c   -1.066646
dtype: float64
a    1.275747
b    1.810401
c    0.853540
dtype: float64

In [47]:
#difference of df
print(df4.max() - df4.min())

a    1.934358
b    3.251199
c    1.920185
dtype: float64

### lambda function

In [49]:
f = lambda x : x.max() - x.min()
d_f = df4.apply(f)
d_f

a    1.934358
b    3.251199
c    1.920185
dtype: float64

In [51]:
d_f1 = df4.apply(f, axis = 1)
d_f1

Utha      1.871084
Ohio      1.512151
Taxas     2.342392
Oregon    1.474263
dtype: float64

In [52]:
def min_max(x):
    minimum = x.min()
    maximum = x.max()
    return pd.Series([minimum, maximum], index=['min', 'max'])

In [55]:
min_max(df4)

min    a   -0.658611
b   -1.440798
c   -1.066646
dtyp...
max    a    1.275747
b    1.810401
c    0.853540
dtyp...
dtype: object

In [60]:
dfs = df4.apply(min_max)
dfs

            a         b         c
min -0.658611 -1.440798 -1.066646
max  1.275747  1.810401  0.853540

### sorting and ranking

In [118]:
df5 = pd.DataFrame(np.arange(8).reshape((2, 4)),
                   index=['three', 'two'], columns=['a', 'd', 'c', 'b'])
print(df5)
print()
print(df5.sort_index(axis = 1, ascending = False)) # by default ascending is true
print()
print(df5.sort_index(axis =1)) # columns

       a  d  c  b
three  0  1  2  3
two    4  5  6  7

       d  c  b  a
three  1  2  3  0
two    5  6  7  4

       a  b  c  d
three  0  3  2  1
two    4  7  6  5

#### sort by value

In [119]:
df4 = df4.abs()
print(df4.sort_values(by='b'))
print(df4.rank(ascending = False, method = 'max'))
print(df4.rank(axis = 'columns'))

               a         b         c
Taxas   1.275747  0.746003  1.066646
Ohio    0.658611  0.844267  0.853540
Oregon  0.033465  1.440798  0.703002
Utha    0.060683  1.810401  0.175776
          a    b    c
Utha    3.0  1.0  4.0
Ohio    2.0  3.0  2.0
Taxas   1.0  4.0  1.0
Oregon  4.0  2.0  3.0
          a    b    c
Utha    1.0  3.0  2.0
Ohio    1.0  2.0  3.0
Taxas   3.0  1.0  2.0
Oregon  1.0  3.0  2.0

In [120]:
print(df4.sum(axis = 0))  # column wise 
print(df4.sum(axis = 1))  # row wise

a    2.028506
b    4.841469
c    2.798964
dtype: float64
Utha      2.046860
Ohio      2.356418
Taxas     3.088395
Oregon    2.177266
dtype: float64

In [124]:
print(df5)
print(df5.mean(axis = "columns", skipna = False))

       a  d  c  b
three  0  1  2  3
two    4  5  6  7
three    1.5
two      5.5
dtype: float64

In [132]:
print(df4['a'].unique(), df4['b'].unique)

[0.06068313 0.65861108 1.27574685 0.03346511] <bound method Series.unique of Utha      1.810401
Ohio      0.844267
Taxas     0.746003
Oregon    1.440798
Name: b, dtype: float64>

In [138]:
df4['c'].value_counts()

0.853540    1
0.703002    1
0.175776    1
1.066646    1
Name: c, dtype: int64